136185925/STM32F769I-DISCO-USB-Audio-Upsampler/Core/Src/usb_audio.c
#include "usb_audio.h"

#include "audio_player.h"
#include "stm32f769i_discovery_audio.h"
#include "spdif_iir_upsampler.h"
#include "spdif_tx.h"
#include "spdif_upsampler.h"
#include "touch.h"
#include "usb_msc.h"
#include "rtc.h"
#include "usbd_audio.h"
#include "usbd_audio_if.h"
#include "FreeRTOS.h"
#include "task.h"

#include <string.h>

#define USB_AUDIO_DEFAULT_SAMPLE_RATE  48000U
#define USB_AUDIO_RATE_44K              44100U
#define USB_AUDIO_RATE_48K              48000U
#define USB_AUDIO_DEFAULT_VOLUME       20U
#define USB_AUDIO_INPUT_FRAME_BYTES    4U
#define USB_AUDIO_INPUT_RING_MASK      (USB_AUDIO_INPUT_RING_FRAMES - 1U)
#define USB_AUDIO_DMA_FRAMES           4096U
#define USB_AUDIO_DMA_HALF_FRAMES      (USB_AUDIO_DMA_FRAMES / 2U)
/* Keep a complete start-watermark in the elastic ring during steady state.
 * After the initial DMA fill the queue begins near 4096 frames, then explicit
 * feedback raises it to this target. The extra guard absorbs the 60-70 ms
 * isochronous OUT gaps observed when both Windows and iPad repeat SET_CUR for
 * the already active sample rate, without increasing initial playback delay. */
#define USB_AUDIO_FEEDBACK_FILTER_SHIFT 6U
#define USB_AUDIO_FEEDBACK_P_Q16        1024LL
#define USB_AUDIO_FEEDBACK_MAX_PPM      5000LL
#define USB_AUDIO_FEEDBACK_I_MAX_PPM    2500LL
#define USB_AUDIO_NOTIFY_DATA          (1UL << 0)
#define USB_AUDIO_NOTIFY_DMA_HALF      (1UL << 1)
#define USB_AUDIO_NOTIFY_DMA_FULL      (1UL << 2)
#define USB_AUDIO_NOTIFY_ERROR         (1UL << 3)
#define USB_AUDIO_NOTIFY_RATE          (1UL << 4)
#define USB_AUDIO_NOTIFY_VOLUME        (1UL << 5)
#define USB_AUDIO_NOTIFY_OUTPUT        (1UL << 6)
#define USB_AUDIO_NOTIFY_SPDIF_MODE    (1UL << 7)
#define USB_AUDIO_VOLUME_APPLY_MS      25U
#define USB_AUDIO_STATS_PUBLISH_MS     250U
#define USB_AUDIO_HOST_BKP_MAGIC       0x55414300UL
#define USB_AUDIO_HOST_BKP_MASK        0xFFFFFF00UL
#define USB_AUDIO_SPDIF_BKP_MAGIC      0x53504400UL
#define USB_AUDIO_SPDIF_BKP_MASK       0xFFFFFF00UL
#define USB_AUDIO_BUFFER_BKP_MAGIC     0x55420000UL
#define USB_AUDIO_BUFFER_BKP_MASK      0xFFFF0000UL
#define USB_AUDIO_SPDIF_FACTOR         SPDIF_UPSAMPLER_FACTOR

#if USB_AUDIO_START_FRAMES_MAX >= USB_AUDIO_INPUT_RING_FRAMES
#error "Maximum USB audio start threshold must be smaller than the input ring"
#endif
#if (USB_AUDIO_INPUT_RING_FRAMES & USB_AUDIO_INPUT_RING_MASK) != 0U
#error "USB audio input ring capacity must be a power of two"
#endif
#if USB_AUDIO_START_FRAMES_MIN < USB_AUDIO_DMA_FRAMES
#error "Minimum USB audio start threshold must cover the complete DMA buffer"
#endif
#if ((USB_AUDIO_START_FRAMES_MAX - USB_AUDIO_START_FRAMES_MIN) % \
     USB_AUDIO_START_FRAMES_STEP) != 0U
#error "USB audio start threshold range must contain complete slider steps"
#endif
#if (USB_AUDIO_DMA_HALF_FRAMES % USB_AUDIO_SPDIF_FACTOR) != 0U
#error "S/PDIF DMA half-buffer must contain complete 4x interpolation groups"
#endif

typedef struct
{
  int16_t left;
  int16_t right;
} USB_AudioFrame;

typedef union
{
  USB_AudioFrame pcm16[USB_AUDIO_DMA_FRAMES];
  uint32_t spdif[USB_AUDIO_DMA_FRAMES * 2U];
} USB_AudioDmaBuffer;

/* Only the SAI DMA buffer needs non-cacheable SRAM. USB ingress and the
 * elastic input ring are CPU-owned and remain in normal cached SRAM. */
__attribute__((section(".dma_buffer"), aligned(32)))
static USB_AudioDmaBuffer usb_audio_dma;

/* CPU-only elastic storage. Keep it in cached internal SRAM: neither USB nor
 * SAI DMA accesses this ring directly, so no cache maintenance is required. */
__attribute__((section(".internal_usb_audio"), aligned(32)))
static USB_AudioFrame usb_audio_input[USB_AUDIO_INPUT_RING_FRAMES];

static TaskHandle_t usb_audio_task_handle;
static USB_AudioSnapshot usb_audio_snapshot;
static volatile uint32_t usb_audio_write_frame;
static volatile uint32_t usb_audio_read_frame;
static volatile uint32_t usb_audio_received_bytes;
static volatile uint32_t usb_audio_received_packets;
static volatile uint32_t usb_audio_underruns;
static volatile uint32_t usb_audio_overruns;
static volatile uint8_t usb_audio_requested;
static volatile uint8_t usb_audio_active;
static volatile uint8_t usb_audio_configured;
static volatile uint8_t usb_audio_high_speed;
static volatile uint8_t usb_audio_prepared;
static volatile uint8_t usb_audio_dma_running;
static volatile uint8_t usb_audio_rebuffer_requested;
static volatile uint8_t usb_audio_muted;
static volatile uint8_t usb_audio_requested_volume = USB_AUDIO_DEFAULT_VOLUME;
static uint8_t usb_audio_applied_volume = USB_AUDIO_DEFAULT_VOLUME;
static uint8_t usb_audio_applied_mute;
static TickType_t usb_audio_last_volume_apply_tick;
static volatile USB_AudioStatus usb_audio_status;
static volatile uint32_t usb_audio_requested_rate = USB_AUDIO_DEFAULT_SAMPLE_RATE;
static volatile uint32_t usb_audio_current_rate = USB_AUDIO_DEFAULT_SAMPLE_RATE;
static volatile USB_AudioOutput usb_audio_output = USB_AUDIO_OUTPUT_WM8994;
static volatile USB_AudioHostMode usb_audio_host_mode = USB_AUDIO_HOST_LINUX;
static volatile USB_AudioSpdifMode usb_audio_spdif_mode =
    USB_AUDIO_SPDIF_NATIVE;
static volatile uint32_t usb_audio_start_frames =
    USB_AUDIO_START_FRAMES_DEFAULT;
static volatile uint32_t usb_audio_active_start_frames =
    USB_AUDIO_START_FRAMES_DEFAULT;
static USB_AudioOutput usb_audio_prepared_output = USB_AUDIO_OUTPUT_WM8994;
static USB_AudioSpdifMode usb_audio_prepared_spdif_mode =
    USB_AUDIO_SPDIF_NATIVE;
static TickType_t usb_audio_last_stats_publish_tick;
static volatile int32_t usb_audio_feedback_integral_q16;
static volatile int32_t usb_audio_feedback_filtered_queue_q8 =
    (int32_t)(USB_AUDIO_START_FRAMES_DEFAULT << 8U);
static uint32_t usb_audio_spdif_status_frame;
static SPDIF_Upsampler4x usb_audio_spdif_upsampler;
static SPDIF_IirUpsampler4x usb_audio_spdif_iir_upsampler;
static SPDIF_HybridUpsampler4x usb_audio_spdif_hybrid_upsampler;

static uint32_t USB_Audio_NormalizeStartFrames(uint32_t frames)
{
  if (frames < USB_AUDIO_START_FRAMES_MIN)
    frames = USB_AUDIO_START_FRAMES_MIN;
  if (frames > USB_AUDIO_START_FRAMES_MAX)
    frames = USB_AUDIO_START_FRAMES_MAX;
  frames = USB_AUDIO_START_FRAMES_MIN +
      (((frames - USB_AUDIO_START_FRAMES_MIN) +
        USB_AUDIO_START_FRAMES_STEP / 2U) /
       USB_AUDIO_START_FRAMES_STEP) * USB_AUDIO_START_FRAMES_STEP;
  return frames;
}

static uint32_t USB_Audio_FeedbackTargetFrames(void)
{
  uint32_t target = usb_audio_active_start_frames;
  const uint32_t maximum =
      USB_AUDIO_INPUT_RING_FRAMES - USB_AUDIO_DMA_FRAMES;
  if (target > maximum) target = maximum;
  return target;
}

static void USB_Audio_Publish(void)
{
  const TickType_t now = xTaskGetTickCount();

