136185925/STM32F769I-DISCO-USB-Audio-Upsampler/Core/Src/usb_audio.c
  taskENTER_CRITICAL();
  const uint8_t state_changed =
      ((usb_audio_snapshot.status != usb_audio_status) ||
       (usb_audio_snapshot.requested != usb_audio_requested) ||
       (usb_audio_snapshot.active != usb_audio_active) ||
       (usb_audio_snapshot.configured != usb_audio_configured) ||
       (usb_audio_snapshot.streaming != usb_audio_dma_running) ||
       (usb_audio_snapshot.high_speed != usb_audio_high_speed) ||
       (usb_audio_snapshot.muted != usb_audio_muted) ||
       (usb_audio_snapshot.volume != usb_audio_requested_volume) ||
       (usb_audio_snapshot.output != usb_audio_output) ||
       (usb_audio_snapshot.host_mode != usb_audio_host_mode) ||
       (usb_audio_snapshot.spdif_mode != usb_audio_spdif_mode) ||
       (usb_audio_snapshot.start_frames != usb_audio_start_frames) ||
       (usb_audio_snapshot.sample_rate != usb_audio_current_rate)) ? 1U : 0U;
  const uint8_t xrun_changed =
      ((usb_audio_snapshot.underruns != usb_audio_underruns) ||
       (usb_audio_snapshot.overruns != usb_audio_overruns)) ? 1U : 0U;
  const uint8_t stats_changed =
      ((usb_audio_snapshot.received_bytes != usb_audio_received_bytes) ||
       (usb_audio_snapshot.received_packets != usb_audio_received_packets)) ?
      1U : 0U;
  const uint8_t stats_due =
      ((stats_changed != 0U) &&
       ((now - usb_audio_last_stats_publish_tick) >=
        pdMS_TO_TICKS(USB_AUDIO_STATS_PUBLISH_MS))) ? 1U : 0U;

  usb_audio_snapshot.status = usb_audio_status;
  usb_audio_snapshot.requested = usb_audio_requested;
  usb_audio_snapshot.active = usb_audio_active;
  usb_audio_snapshot.configured = usb_audio_configured;
  usb_audio_snapshot.streaming = usb_audio_dma_running;
  usb_audio_snapshot.high_speed = usb_audio_high_speed;
  usb_audio_snapshot.muted = usb_audio_muted;
  usb_audio_snapshot.volume = usb_audio_requested_volume;
  usb_audio_snapshot.output = usb_audio_output;
  usb_audio_snapshot.host_mode = usb_audio_host_mode;
  usb_audio_snapshot.spdif_mode = usb_audio_spdif_mode;
  usb_audio_snapshot.start_frames = usb_audio_start_frames;
  usb_audio_snapshot.sample_rate = usb_audio_current_rate;
  usb_audio_snapshot.received_bytes = usb_audio_received_bytes;
  usb_audio_snapshot.received_packets = usb_audio_received_packets;
  usb_audio_snapshot.underruns = usb_audio_underruns;
  usb_audio_snapshot.overruns = usb_audio_overruns;
  if ((state_changed != 0U) || (xrun_changed != 0U) || (stats_due != 0U))
  {
    ++usb_audio_snapshot.generation;
    usb_audio_last_stats_publish_tick = now;
  }
  taskEXIT_CRITICAL();
}

void USB_Audio_CreateResources(void)
{
  const uint32_t saved_host = HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR1);
  const uint32_t saved_spdif = HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR2);
  const uint32_t saved_buffer = HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR3);

  memset(&usb_audio_snapshot, 0, sizeof(usb_audio_snapshot));
  usb_audio_snapshot.status = USB_AUDIO_OFF;
  usb_audio_requested_rate = USB_AUDIO_DEFAULT_SAMPLE_RATE;
  usb_audio_current_rate = USB_AUDIO_DEFAULT_SAMPLE_RATE;
  usb_audio_requested_volume = USB_AUDIO_DEFAULT_VOLUME;
  usb_audio_applied_volume = USB_AUDIO_DEFAULT_VOLUME;
  usb_audio_snapshot.sample_rate = USB_AUDIO_DEFAULT_SAMPLE_RATE;
  usb_audio_status = USB_AUDIO_OFF;
  usb_audio_output = USB_AUDIO_OUTPUT_WM8994;
  usb_audio_host_mode =
      (((saved_host & USB_AUDIO_HOST_BKP_MASK) == USB_AUDIO_HOST_BKP_MAGIC) &&
       ((saved_host & 0xFFU) == (uint32_t)USB_AUDIO_HOST_WINDOWS)) ?
      USB_AUDIO_HOST_WINDOWS : USB_AUDIO_HOST_LINUX;
  if ((saved_spdif & USB_AUDIO_SPDIF_BKP_MASK) ==
      USB_AUDIO_SPDIF_BKP_MAGIC)
  {
    const uint32_t saved_mode = saved_spdif & 0xFFU;
    if (saved_mode ==
        (uint32_t)USB_AUDIO_SPDIF_UPSAMPLE_4X_BESSEL_MINPHASE_NS5)
      usb_audio_spdif_mode =
          USB_AUDIO_SPDIF_UPSAMPLE_4X_BESSEL_MINPHASE_NS5;
    else if (saved_mode ==
        (uint32_t)USB_AUDIO_SPDIF_UPSAMPLE_4X_BESSEL_OPEN_NS2)
      usb_audio_spdif_mode =
          USB_AUDIO_SPDIF_UPSAMPLE_4X_BESSEL_OPEN_NS2;
    else if (saved_mode ==
        (uint32_t)USB_AUDIO_SPDIF_UPSAMPLE_4X_BESSEL_MINPHASE_NS2)
      usb_audio_spdif_mode =
          USB_AUDIO_SPDIF_UPSAMPLE_4X_BESSEL_MINPHASE_NS2;
    else if (saved_mode ==
        (uint32_t)USB_AUDIO_SPDIF_UPSAMPLE_4X_BUTTERWORTH_MINPHASE_NS2)
      usb_audio_spdif_mode =
          USB_AUDIO_SPDIF_UPSAMPLE_4X_BUTTERWORTH_MINPHASE_NS2;
    else if (saved_mode ==
        (uint32_t)USB_AUDIO_SPDIF_UPSAMPLE_4X_BUTTERWORTH_NS2)
      usb_audio_spdif_mode = USB_AUDIO_SPDIF_UPSAMPLE_4X_BUTTERWORTH_NS2;
    else if (saved_mode ==
        (uint32_t)USB_AUDIO_SPDIF_UPSAMPLE_4X_HYBRID_NS2)
      usb_audio_spdif_mode = USB_AUDIO_SPDIF_UPSAMPLE_4X_HYBRID_NS2;
    else if (saved_mode == (uint32_t)USB_AUDIO_SPDIF_UPSAMPLE_4X_HYBRID)
      usb_audio_spdif_mode = USB_AUDIO_SPDIF_UPSAMPLE_4X_HYBRID;
    else if (saved_mode == (uint32_t)USB_AUDIO_SPDIF_UPSAMPLE_4X_IIR)
      usb_audio_spdif_mode = USB_AUDIO_SPDIF_UPSAMPLE_4X_IIR;
    else if (saved_mode == (uint32_t)USB_AUDIO_SPDIF_UPSAMPLE_4X_TPDF)
      usb_audio_spdif_mode = USB_AUDIO_SPDIF_UPSAMPLE_4X_TPDF;
    else if (saved_mode == (uint32_t)USB_AUDIO_SPDIF_UPSAMPLE_4X_HEADROOM)
      usb_audio_spdif_mode = USB_AUDIO_SPDIF_UPSAMPLE_4X_HEADROOM;
    else if (saved_mode == (uint32_t)USB_AUDIO_SPDIF_REPEAT_4X)
      usb_audio_spdif_mode = USB_AUDIO_SPDIF_REPEAT_4X;
    else if (saved_mode == (uint32_t)USB_AUDIO_SPDIF_UPSAMPLE_4X)
      usb_audio_spdif_mode = USB_AUDIO_SPDIF_UPSAMPLE_4X;
    else
      usb_audio_spdif_mode = USB_AUDIO_SPDIF_NATIVE;
  }
  else
  {
    usb_audio_spdif_mode = USB_AUDIO_SPDIF_NATIVE;
  }
  if ((saved_buffer & USB_AUDIO_BUFFER_BKP_MASK) ==
      USB_AUDIO_BUFFER_BKP_MAGIC)
  {
    usb_audio_start_frames = USB_Audio_NormalizeStartFrames(
        saved_buffer & 0xFFFFU);
  }
  else
  {
    usb_audio_start_frames = USB_AUDIO_START_FRAMES_DEFAULT;
  }
  usb_audio_active_start_frames = usb_audio_start_frames;
  usb_audio_snapshot.host_mode = usb_audio_host_mode;
  usb_audio_snapshot.spdif_mode = usb_audio_spdif_mode;
  usb_audio_snapshot.start_frames = usb_audio_start_frames;
  usb_audio_prepared_output = USB_AUDIO_OUTPUT_WM8994;
  usb_audio_prepared_spdif_mode = usb_audio_spdif_mode;
  usb_audio_last_stats_publish_tick = 0U;
}

void USB_Audio_GetSnapshot(USB_AudioSnapshot *snapshot)
{
  if (snapshot == NULL) return;
  taskENTER_CRITICAL();
  *snapshot = usb_audio_snapshot;
  taskEXIT_CRITICAL();
}

