136185925/STM32F769I-DISCO-USB-Audio-Upsampler/Core/Src/usb_audio.c
void USB_Audio_RequestEnable(uint8_t enable)
{
  usb_audio_requested = (enable != 0U) ? 1U : 0U;
  if (enable != 0U) USB_MSC_RequestEnable(0U);
  USB_MSC_WakeManager();
  USB_Audio_Publish();
}

void USB_Audio_RequestVolume(uint8_t volume)
{
  uint8_t requested = (volume > 100U) ? 100U : volume;
  if (requested == usb_audio_requested_volume) return;

  usb_audio_requested_volume = requested;
  if (usb_audio_task_handle != NULL)
  {
    (void)xTaskNotify(usb_audio_task_handle, USB_AUDIO_NOTIFY_VOLUME, eSetBits);
  }
  USB_Audio_Publish();
}

void USB_Audio_RequestOutput(USB_AudioOutput output)
{
  USB_AudioOutput requested = (output == USB_AUDIO_OUTPUT_SPDIF) ?
                              USB_AUDIO_OUTPUT_SPDIF :
                              USB_AUDIO_OUTPUT_WM8994;
  if (requested == usb_audio_output) return;

  usb_audio_output = requested;
  if (AudioPlayer_IsBusy() != 0U) AudioPlayer_RequestStop();
  if (usb_audio_task_handle != NULL)
  {
    (void)xTaskNotify(usb_audio_task_handle, USB_AUDIO_NOTIFY_OUTPUT, eSetBits);
  }
  USB_Audio_Publish();
}

USB_AudioOutput USB_Audio_GetOutput(void)
{
  return usb_audio_output;
}

void USB_Audio_RequestHostMode(USB_AudioHostMode mode)
{
  const USB_AudioHostMode requested =
      (mode == USB_AUDIO_HOST_WINDOWS) ? USB_AUDIO_HOST_WINDOWS :
                                         USB_AUDIO_HOST_LINUX;
  if (requested == usb_audio_host_mode) return;

  usb_audio_host_mode = requested;
  HAL_PWR_EnableBkUpAccess();
  HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR1,
                      USB_AUDIO_HOST_BKP_MAGIC | (uint32_t)requested);

  /* The host mode changes the VID/PID and the complete Audio descriptor tree.
     Wake the USB manager so an active connection disconnects and enumerates
     again with the newly selected class version. */
  USB_MSC_WakeManager();
  USB_Audio_Publish();
}

USB_AudioHostMode USB_Audio_GetHostMode(void)
{
  return usb_audio_host_mode;
}

void USB_Audio_RequestSpdifMode(USB_AudioSpdifMode mode)
{
  USB_AudioSpdifMode requested = USB_AUDIO_SPDIF_NATIVE;
  if (mode == USB_AUDIO_SPDIF_UPSAMPLE_4X_BESSEL_MINPHASE_NS5)
    requested = USB_AUDIO_SPDIF_UPSAMPLE_4X_BESSEL_MINPHASE_NS5;
  else if (mode == USB_AUDIO_SPDIF_UPSAMPLE_4X_BESSEL_OPEN_NS2)
    requested = USB_AUDIO_SPDIF_UPSAMPLE_4X_BESSEL_OPEN_NS2;
  else if (mode == USB_AUDIO_SPDIF_UPSAMPLE_4X_BESSEL_MINPHASE_NS2)
    requested = USB_AUDIO_SPDIF_UPSAMPLE_4X_BESSEL_MINPHASE_NS2;
  else if (mode == USB_AUDIO_SPDIF_UPSAMPLE_4X_BUTTERWORTH_MINPHASE_NS2)
    requested = USB_AUDIO_SPDIF_UPSAMPLE_4X_BUTTERWORTH_MINPHASE_NS2;
  else if (mode == USB_AUDIO_SPDIF_UPSAMPLE_4X_BUTTERWORTH_NS2)
    requested = USB_AUDIO_SPDIF_UPSAMPLE_4X_BUTTERWORTH_NS2;
  else if (mode == USB_AUDIO_SPDIF_UPSAMPLE_4X_HYBRID_NS2)
    requested = USB_AUDIO_SPDIF_UPSAMPLE_4X_HYBRID_NS2;
  else if (mode == USB_AUDIO_SPDIF_UPSAMPLE_4X_HYBRID)
    requested = USB_AUDIO_SPDIF_UPSAMPLE_4X_HYBRID;
  else if (mode == USB_AUDIO_SPDIF_UPSAMPLE_4X_IIR)
    requested = USB_AUDIO_SPDIF_UPSAMPLE_4X_IIR;
  else if (mode == USB_AUDIO_SPDIF_UPSAMPLE_4X_TPDF)
    requested = USB_AUDIO_SPDIF_UPSAMPLE_4X_TPDF;
  else if (mode == USB_AUDIO_SPDIF_UPSAMPLE_4X_HEADROOM)
    requested = USB_AUDIO_SPDIF_UPSAMPLE_4X_HEADROOM;
  else if (mode == USB_AUDIO_SPDIF_REPEAT_4X)
    requested = USB_AUDIO_SPDIF_REPEAT_4X;
  else if (mode == USB_AUDIO_SPDIF_UPSAMPLE_4X)
    requested = USB_AUDIO_SPDIF_UPSAMPLE_4X;
  if (requested == usb_audio_spdif_mode) return;

  usb_audio_spdif_mode = requested;
  /* MUSIC shares the selected S/PDIF transport. Stop a current file cleanly
   * so its next start uses the newly selected output clock and formatter. */
  AudioPlayer_RequestStop();
  HAL_PWR_EnableBkUpAccess();
  HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR2,
                      USB_AUDIO_SPDIF_BKP_MAGIC | (uint32_t)requested);
  if (usb_audio_task_handle != NULL)
  {
    (void)xTaskNotify(usb_audio_task_handle, USB_AUDIO_NOTIFY_SPDIF_MODE,
                      eSetBits);
  }
  USB_Audio_Publish();
}

USB_AudioSpdifMode USB_Audio_GetSpdifMode(void)
{
  return usb_audio_spdif_mode;
}

void USB_Audio_RequestStartFrames(uint32_t frames)
{
  const uint32_t requested = USB_Audio_NormalizeStartFrames(frames);
  if (requested == usb_audio_start_frames) return;

  usb_audio_start_frames = requested;
  HAL_PWR_EnableBkUpAccess();
  HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR3,
                      USB_AUDIO_BUFFER_BKP_MAGIC | requested);

  /* Do not move the asynchronous feedback target under an active stream.
   * The selection becomes active immediately while idle, or at the next
   * stream reset/rebuffer boundary while playing. */
  if (usb_audio_dma_running == 0U)
  {
    usb_audio_active_start_frames = requested;
    usb_audio_feedback_integral_q16 = 0;
    usb_audio_feedback_filtered_queue_q8 =
        (int32_t)(USB_Audio_FeedbackTargetFrames() << 8U);
  }
  if (usb_audio_task_handle != NULL)
  {
    (void)xTaskNotify(usb_audio_task_handle, USB_AUDIO_NOTIFY_DATA, eSetBits);
  }
  USB_Audio_Publish();
}

uint32_t USB_Audio_GetStartFrames(void)
{
  return usb_audio_start_frames;
}

uint8_t USB_Audio_EnableRequested(void)
{
  return usb_audio_requested;
}

uint8_t USB_Audio_IsActive(void)
{
  return usb_audio_active;
}

uint8_t USB_Audio_ClaimsCodec(void)
{
  return usb_audio_requested;
}

void USB_Audio_SetDeviceState(USB_AudioStatus status, uint8_t active,
                              uint8_t configured, uint8_t high_speed)
{
  usb_audio_status = status;
  usb_audio_active = active;
  usb_audio_configured = configured;
  usb_audio_high_speed = high_speed;
  USB_Audio_Publish();
}

static void USB_Audio_ResetStream(void)
{
  taskENTER_CRITICAL();
  usb_audio_write_frame = 0U;
  usb_audio_read_frame = 0U;
  usb_audio_dma_running = 0U;
  usb_audio_rebuffer_requested = 0U;
  usb_audio_active_start_frames = usb_audio_start_frames;
  usb_audio_feedback_integral_q16 = 0;
  usb_audio_feedback_filtered_queue_q8 =
      (int32_t)(USB_Audio_FeedbackTargetFrames() << 8U);
  usb_audio_spdif_status_frame = 0U;
  SPDIF_Upsampler4x_Reset(&usb_audio_spdif_upsampler);
  SPDIF_IirUpsampler4x_Reset(&usb_audio_spdif_iir_upsampler);
  SPDIF_HybridUpsampler4x_Reset(&usb_audio_spdif_hybrid_upsampler);
  taskEXIT_CRITICAL();
  memset(&usb_audio_dma, 0, sizeof(usb_audio_dma));
}

