136185925/STM32F769I-DISCO-USB-Audio-Upsampler/Core/Src/usb_audio.c
static void USB_Audio_StopPreparedHardware(void)
{
  if (usb_audio_prepared_output == USB_AUDIO_OUTPUT_SPDIF)
  {
    SPDIF_TX_Stop();
    SPDIF_TX_DeInit();
  }
  else
  {
    if (Touch_I2C_Reserve(500U) != 0U)
    {
      (void)BSP_AUDIO_OUT_Stop(CODEC_PDWN_SW);
      Touch_I2C_Release();
    }
    BSP_AUDIO_OUT_DeInit();
  }
}

static uint8_t USB_Audio_ConfigureHardware(uint32_t sample_rate)
{
  uint8_t result = AUDIO_ERROR;
  USB_AudioOutput output;

  if ((sample_rate != USB_AUDIO_RATE_44K) &&
      (sample_rate != USB_AUDIO_RATE_48K))
  {
    return 0U;
  }

  if (usb_audio_prepared != 0U)
  {
    usb_audio_prepared = 0U;
    usb_audio_dma_running = 0U;
    USB_Audio_StopPreparedHardware();
  }

  USB_Audio_ResetStream();
  output = usb_audio_output;
  if (output == USB_AUDIO_OUTPUT_SPDIF)
  {
    const uint8_t upsample =
        (usb_audio_spdif_mode != USB_AUDIO_SPDIF_NATIVE) ? 1U : 0U;
    const uint32_t output_rate =
        upsample != 0U ? sample_rate * USB_AUDIO_SPDIF_FACTOR : sample_rate;
    SPDIF_IirUpsampler4x_Init(&usb_audio_spdif_iir_upsampler, sample_rate);
    if (usb_audio_spdif_mode ==
        USB_AUDIO_SPDIF_UPSAMPLE_4X_BESSEL_MINPHASE_NS5)
    {
      SPDIF_MinimumPhaseUpsampler4x_InitBesselNoiseShaped5(
          &usb_audio_spdif_hybrid_upsampler, sample_rate);
    }
    else if (usb_audio_spdif_mode ==
             USB_AUDIO_SPDIF_UPSAMPLE_4X_BESSEL_OPEN_NS2)
    {
      SPDIF_MinimumPhaseUpsampler4x_InitBesselOpen(
          &usb_audio_spdif_hybrid_upsampler, sample_rate);
    }
    else if (usb_audio_spdif_mode ==
        USB_AUDIO_SPDIF_UPSAMPLE_4X_BESSEL_MINPHASE_NS2)
    {
      SPDIF_MinimumPhaseUpsampler4x_InitBessel(
          &usb_audio_spdif_hybrid_upsampler, sample_rate);
    }
    else if ((usb_audio_spdif_mode ==
         USB_AUDIO_SPDIF_UPSAMPLE_4X_BUTTERWORTH_NS2) ||
        (usb_audio_spdif_mode ==
         USB_AUDIO_SPDIF_UPSAMPLE_4X_BUTTERWORTH_MINPHASE_NS2))
    {
      SPDIF_HybridUpsampler4x_InitButterworth(
          &usb_audio_spdif_hybrid_upsampler, sample_rate);
    }
    else
    {
      SPDIF_HybridUpsampler4x_Init(&usb_audio_spdif_hybrid_upsampler,
                                   sample_rate);
    }
    result = (SPDIF_TX_Init(output_rate, 16U) != 0U) ?
             AUDIO_OK : AUDIO_ERROR;
  }
  else
  {
    if (Touch_I2C_Reserve(500U) == 0U)
    {
      return 0U;
    }
    result = BSP_AUDIO_OUT_InitEx(OUTPUT_DEVICE_HEADPHONE,
                                  usb_audio_requested_volume,
                                  sample_rate, 16U);
    if (result == AUDIO_OK)
    {
      BSP_AUDIO_OUT_SetAudioFrameSlot(CODEC_AUDIOFRAME_SLOT_02);
    }
    Touch_I2C_Release();
  }
  if (result != AUDIO_OK)
  {
    return 0U;
  }

  usb_audio_current_rate = sample_rate;
  usb_audio_applied_volume = usb_audio_requested_volume;
  usb_audio_applied_mute =
      (usb_audio_applied_volume == 0U) ? 1U : 0U;
  usb_audio_last_volume_apply_tick = xTaskGetTickCount();
  usb_audio_prepared_output = output;
  usb_audio_prepared_spdif_mode = usb_audio_spdif_mode;
  usb_audio_prepared = 1U;
  return 1U;
}

uint8_t USB_Audio_PrepareHardware(void)
{
  uint8_t result;

  USB_Audio_ResetStream();
  usb_audio_received_bytes = 0U;
  usb_audio_received_packets = 0U;
  usb_audio_underruns = 0U;
  usb_audio_overruns = 0U;
  usb_audio_muted = 0U;
  usb_audio_applied_mute =
      (usb_audio_requested_volume == 0U) ? 1U : 0U;
  usb_audio_requested_rate = USB_AUDIO_DEFAULT_SAMPLE_RATE;

  result = USB_Audio_ConfigureHardware(USB_AUDIO_DEFAULT_SAMPLE_RATE);
  return result;
}

void USB_Audio_ReleaseHardware(void)
{
  uint8_t was_prepared = usb_audio_prepared;
  usb_audio_prepared = 0U;
  usb_audio_dma_running = 0U;
  if (was_prepared != 0U) USB_Audio_StopPreparedHardware();
  USB_Audio_ResetStream();
}

static uint32_t USB_Audio_FillDmaHalf(uint8_t half)
{
  uint32_t read_frame = usb_audio_read_frame;
  uint32_t write_frame = usb_audio_write_frame;
  uint32_t available = write_frame - read_frame;
  uint32_t missing;

  if (usb_audio_prepared_output == USB_AUDIO_OUTPUT_SPDIF)
  {
    uint32_t *destination =
        &usb_audio_dma.spdif[(uint32_t)half *
                             USB_AUDIO_DMA_HALF_FRAMES * 2U];
    if (usb_audio_prepared_spdif_mode != USB_AUDIO_SPDIF_NATIVE)
    {
      const uint32_t output_rate =
          usb_audio_current_rate * USB_AUDIO_SPDIF_FACTOR;
      const uint32_t groups_needed =
          USB_AUDIO_DMA_HALF_FRAMES / USB_AUDIO_SPDIF_FACTOR;
      const uint32_t groups =
          (available < groups_needed) ? available : groups_needed;
      for (uint32_t group = 0U; group < groups; ++group)
      {
        const USB_AudioFrame source =
            usb_audio_input[(read_frame + group) & USB_AUDIO_INPUT_RING_MASK];
        int16_t interpolated[USB_AUDIO_SPDIF_FACTOR * 2U];
        if (usb_audio_prepared_spdif_mode == USB_AUDIO_SPDIF_REPEAT_4X)
        {
          for (uint32_t phase = 0U; phase < USB_AUDIO_SPDIF_FACTOR; ++phase)
          {
            interpolated[phase * 2U] = source.left;
            interpolated[phase * 2U + 1U] = source.right;
          }
        }
        else if (usb_audio_prepared_spdif_mode ==
                 USB_AUDIO_SPDIF_UPSAMPLE_4X_IIR)
        {
          SPDIF_IirUpsampler4x_Process(&usb_audio_spdif_iir_upsampler,
              source.left, source.right, interpolated);
        }
        else if (usb_audio_prepared_spdif_mode ==
                 USB_AUDIO_SPDIF_UPSAMPLE_4X_BESSEL_MINPHASE_NS5)
        {
          SPDIF_MinimumPhaseUpsampler4x_ProcessNoiseShaped5(
              &usb_audio_spdif_hybrid_upsampler, source.left, source.right,
              interpolated);
        }
        else if ((usb_audio_prepared_spdif_mode ==
                  USB_AUDIO_SPDIF_UPSAMPLE_4X_BUTTERWORTH_MINPHASE_NS2) ||
                 (usb_audio_prepared_spdif_mode ==
                  USB_AUDIO_SPDIF_UPSAMPLE_4X_BESSEL_MINPHASE_NS2) ||
                 (usb_audio_prepared_spdif_mode ==
                  USB_AUDIO_SPDIF_UPSAMPLE_4X_BESSEL_OPEN_NS2))
        {
          SPDIF_MinimumPhaseUpsampler4x_ProcessNoiseShaped2(
              &usb_audio_spdif_hybrid_upsampler, source.left, source.right,
              interpolated);
        }
        else if ((usb_audio_prepared_spdif_mode ==
                  USB_AUDIO_SPDIF_UPSAMPLE_4X_BUTTERWORTH_NS2) ||
                 (usb_audio_prepared_spdif_mode ==
                  USB_AUDIO_SPDIF_UPSAMPLE_4X_HYBRID_NS2))
        {
          SPDIF_HybridUpsampler4x_ProcessNoiseShaped2(
              &usb_audio_spdif_hybrid_upsampler, source.left, source.right,
              interpolated);
        }
        else if (usb_audio_prepared_spdif_mode ==
                 USB_AUDIO_SPDIF_UPSAMPLE_4X_HYBRID)
        {
          SPDIF_HybridUpsampler4x_Process(
              &usb_audio_spdif_hybrid_upsampler, source.left, source.right,
              interpolated);
        }
        else
        {
          SPDIF_Upsampler4x_Process(&usb_audio_spdif_upsampler,
              source.left, source.right, interpolated,
              ((usb_audio_prepared_spdif_mode ==
                USB_AUDIO_SPDIF_UPSAMPLE_4X_HEADROOM) ||
               (usb_audio_prepared_spdif_mode ==
                USB_AUDIO_SPDIF_UPSAMPLE_4X_TPDF)) ? 1U : 0U,
              (usb_audio_prepared_spdif_mode ==
               USB_AUDIO_SPDIF_UPSAMPLE_4X_TPDF) ? 1U : 0U);
        }

        for (uint32_t phase = 0U; phase < USB_AUDIO_SPDIF_FACTOR; ++phase)
        {
          const uint32_t output_frame =
              group * USB_AUDIO_SPDIF_FACTOR + phase;
          destination[output_frame * 2U] =
              SPDIF_TX_EncodeSample(interpolated[phase * 2U], 16U,
                                    output_rate,
                                    usb_audio_spdif_status_frame);
          destination[output_frame * 2U + 1U] =
              SPDIF_TX_EncodeSample(interpolated[phase * 2U + 1U], 16U,
                                    output_rate,
                                    usb_audio_spdif_status_frame);
          usb_audio_spdif_status_frame =
              (usb_audio_spdif_status_frame + 1U) % 192U;
        }
      }
      read_frame += groups;
      missing = USB_AUDIO_DMA_HALF_FRAMES -
                groups * USB_AUDIO_SPDIF_FACTOR;

      /* Preserve valid IEC60958 channel-status bits while padding an
       * underrun with silence. Do not interpolate across a later track gap. */
      for (uint32_t frame = USB_AUDIO_DMA_HALF_FRAMES - missing;
           frame < USB_AUDIO_DMA_HALF_FRAMES; ++frame)
      {
        destination[frame * 2U] =
            SPDIF_TX_EncodeSample(0, 16U, output_rate,
                                  usb_audio_spdif_status_frame);
        destination[frame * 2U + 1U] =
            SPDIF_TX_EncodeSample(0, 16U, output_rate,
                                  usb_audio_spdif_status_frame);
        usb_audio_spdif_status_frame =
            (usb_audio_spdif_status_frame + 1U) % 192U;
      }
      if (missing != 0U)
      {
        SPDIF_Upsampler4x_Reset(&usb_audio_spdif_upsampler);
        SPDIF_IirUpsampler4x_Reset(&usb_audio_spdif_iir_upsampler);
        SPDIF_HybridUpsampler4x_Reset(&usb_audio_spdif_hybrid_upsampler);
      }
    }
    else
    {
      const uint32_t copied =
          (available < USB_AUDIO_DMA_HALF_FRAMES) ?
          available : USB_AUDIO_DMA_HALF_FRAMES;
      missing = USB_AUDIO_DMA_HALF_FRAMES - copied;
      for (uint32_t frame = 0U; frame < USB_AUDIO_DMA_HALF_FRAMES; ++frame)
      {
        int16_t left = 0;
        int16_t right = 0;
        if (frame < copied)
        {
          const USB_AudioFrame *source =
              &usb_audio_input[(read_frame + frame) &
                               USB_AUDIO_INPUT_RING_MASK];
          left = source->left;
          right = source->right;
        }
        destination[frame * 2U] =
            SPDIF_TX_EncodeSample(left, 16U, usb_audio_current_rate,
                                  usb_audio_spdif_status_frame);
        destination[frame * 2U + 1U] =
            SPDIF_TX_EncodeSample(right, 16U, usb_audio_current_rate,
                                  usb_audio_spdif_status_frame);
        usb_audio_spdif_status_frame =
            (usb_audio_spdif_status_frame + 1U) % 192U;
      }
      read_frame += copied;
    }
  }
  else
  {
    const uint32_t copied =
        (available < USB_AUDIO_DMA_HALF_FRAMES) ?
        available : USB_AUDIO_DMA_HALF_FRAMES;
    const uint32_t read_index = read_frame & USB_AUDIO_INPUT_RING_MASK;
    USB_AudioFrame *destination =
        &usb_audio_dma.pcm16[(uint32_t)half * USB_AUDIO_DMA_HALF_FRAMES];
    missing = USB_AUDIO_DMA_HALF_FRAMES - copied;
    uint32_t first = USB_AUDIO_INPUT_RING_FRAMES - read_index;
    if (first > copied) first = copied;
    if (first != 0U)
    {
      memcpy(destination, &usb_audio_input[read_index],
             first * sizeof(USB_AudioFrame));
    }
    if (copied > first)
    {
      memcpy(&destination[first], usb_audio_input,
             (copied - first) * sizeof(USB_AudioFrame));
    }
    if (missing != 0U)
    {
      memset(&destination[copied], 0,
             missing * sizeof(USB_AudioFrame));
    }
    read_frame += copied;
  }
  if (missing != 0U)
  {
    ++usb_audio_underruns;
  }

  __DMB();
  usb_audio_read_frame = read_frame;
  return missing;
}

static uint8_t USB_Audio_StopForRebuffer(void)
{
  uint8_t stopped = 0U;

  if (usb_audio_prepared_output == USB_AUDIO_OUTPUT_SPDIF)
  {
    SPDIF_TX_Stop();
    stopped = 1U;
  }
  else if (Touch_I2C_Reserve(50U) != 0U)
  {
    /* BSP stops SAI DMA before touching the codec, so the transport is
       stopped even if a subsequent mute register write reports an error. */
    if (BSP_AUDIO_OUT_Stop(CODEC_PDWN_SW) == AUDIO_OK)
      usb_audio_applied_mute = 1U;
    stopped = 1U;
    Touch_I2C_Release();
  }

  if (stopped != 0U)
  {
    usb_audio_dma_running = 0U;
    usb_audio_rebuffer_requested = 0U;
    usb_audio_active_start_frames = usb_audio_start_frames;
    usb_audio_feedback_integral_q16 = 0;
    usb_audio_feedback_filtered_queue_q8 =
        (int32_t)(USB_Audio_FeedbackTargetFrames() << 8U);
  }
  return stopped;
}

static void USB_Audio_ReceivePacket(const uint8_t *data, uint32_t size)
{
  uint32_t frames = size / USB_AUDIO_INPUT_FRAME_BYTES;
  uint32_t write_frame = usb_audio_write_frame;
  uint32_t read_frame = usb_audio_read_frame;
  uint32_t queued_before = write_frame - read_frame;
  uint32_t free_frames = USB_AUDIO_INPUT_RING_FRAMES -
                         queued_before;
  uint32_t accepted = frames;

