136185925/STM32F769I-DISCO-USB-Audio-Upsampler/Core/Src/usb_audio.c
  if ((data == NULL) || (frames == 0U) || (usb_audio_prepared == 0U)) return;
  if (accepted >= free_frames)
  {
    accepted = (free_frames > 1U) ? free_frames - 1U : 0U;
    ++usb_audio_overruns;
  }
  for (uint32_t frame = 0U; frame < accepted; ++frame)
  {
    const uint8_t *source = &data[frame * USB_AUDIO_INPUT_FRAME_BYTES];
    USB_AudioFrame *target =
        &usb_audio_input[(write_frame + frame) & USB_AUDIO_INPUT_RING_MASK];
    target->left = (int16_t)((uint16_t)source[0] |
                             ((uint16_t)source[1] << 8));
    target->right = (int16_t)((uint16_t)source[2] |
                              ((uint16_t)source[3] << 8));
  }
  __DMB();
  usb_audio_write_frame = write_frame + accepted;
  usb_audio_received_bytes += accepted * USB_AUDIO_INPUT_FRAME_BYTES;
  ++usb_audio_received_packets;
  /* Packet callbacks run every USB microframe. Wake the high-priority audio
     task only once when the initial prebuffer crosses its start watermark;
     SAI DMA half/full callbacks drive all steady-state refills. */
  const uint32_t start_frames = usb_audio_active_start_frames;
  if ((usb_audio_task_handle != NULL) &&
      (usb_audio_dma_running == 0U) &&
      (queued_before < start_frames) &&
      ((queued_before + accepted) >= start_frames))
  {
    BaseType_t wake = pdFALSE;
    (void)xTaskNotifyFromISR(usb_audio_task_handle, USB_AUDIO_NOTIFY_DATA,
                             eSetBits, &wake);
    portYIELD_FROM_ISR(wake);
  }
}

uint8_t USB_Audio_DmaIsRunning(void)
{
  return usb_audio_dma_running;
}

static void USB_Audio_NotifyDma(uint32_t bit)
{
  if (usb_audio_task_handle != NULL)
  {
    BaseType_t wake = pdFALSE;
    (void)xTaskNotifyFromISR(usb_audio_task_handle, bit, eSetBits, &wake);
    portYIELD_FROM_ISR(wake);
  }
}

void USB_Audio_DmaHalfCallback(void)
{
  USB_Audio_NotifyDma(USB_AUDIO_NOTIFY_DMA_HALF);
}

void USB_Audio_DmaFullCallback(void)
{
  USB_Audio_NotifyDma(USB_AUDIO_NOTIFY_DMA_FULL);
}

void USB_Audio_DmaErrorCallback(void)
{
  USB_Audio_NotifyDma(USB_AUDIO_NOTIFY_ERROR);
}

void USB_Audio_Task(void const *argument)
{
  uint32_t notify_bits;
  TickType_t wait_ticks = pdMS_TO_TICKS(100U);
  (void)argument;
  usb_audio_task_handle = xTaskGetCurrentTaskHandle();

  for (;;)
  {
    notify_bits = 0U;
    (void)xTaskNotifyWait(0U, 0xFFFFFFFFUL, &notify_bits,
                          wait_ticks);
    wait_ticks = pdMS_TO_TICKS(100U);
    if ((usb_audio_active != 0U) && (usb_audio_prepared != 0U))
    {
      if ((usb_audio_requested_rate != usb_audio_current_rate) ||
          (usb_audio_output != usb_audio_prepared_output) ||
          ((usb_audio_output == USB_AUDIO_OUTPUT_SPDIF) &&
           ((usb_audio_spdif_mode != usb_audio_prepared_spdif_mode) ||
            ((notify_bits & USB_AUDIO_NOTIFY_SPDIF_MODE) != 0U))) ||
          ((notify_bits & USB_AUDIO_NOTIFY_OUTPUT) != 0U))
      {
        uint32_t new_rate = usb_audio_requested_rate;
        if (USB_Audio_ConfigureHardware(new_rate) == 0U)
        {
          usb_audio_status = USB_AUDIO_ERROR;
          USB_Audio_Publish();
          continue;
        }
        /* The old DMA notifications belong to the stopped stream. */
        notify_bits &= ~(USB_AUDIO_NOTIFY_DMA_HALF |
                         USB_AUDIO_NOTIFY_DMA_FULL |
                         USB_AUDIO_NOTIFY_ERROR |
                         USB_AUDIO_NOTIFY_SPDIF_MODE);
      }

      if ((usb_audio_prepared_output == USB_AUDIO_OUTPUT_WM8994) &&
          (usb_audio_requested_volume != usb_audio_applied_volume))
      {
        const TickType_t minimum_ticks =
            pdMS_TO_TICKS(USB_AUDIO_VOLUME_APPLY_MS);
        const TickType_t now = xTaskGetTickCount();
        const TickType_t elapsed = now - usb_audio_last_volume_apply_tick;
        if (elapsed >= minimum_ticks)
        {
          const uint8_t target_volume = usb_audio_requested_volume;
          if (Touch_I2C_Reserve(20U) != 0U)
          {
            if (BSP_AUDIO_OUT_SetVolume(target_volume) == AUDIO_OK)
            {
              usb_audio_applied_volume = target_volume;
              /* SetVolume(0) mutes; every non-zero value unmutes. Reconcile
                 the independent USB mute state immediately below. */
              usb_audio_applied_mute =
                  (target_volume == 0U) ? 1U : 0U;
              usb_audio_last_volume_apply_tick = now;
            }
            Touch_I2C_Release();
          }
        }
        else
        {
          wait_ticks = minimum_ticks - elapsed;
        }
      }

      const uint8_t target_mute =
          ((usb_audio_muted != 0U) ||
           (usb_audio_requested_volume == 0U)) ? 1U : 0U;
      if ((usb_audio_prepared_output == USB_AUDIO_OUTPUT_WM8994) &&
          (target_mute != usb_audio_applied_mute))
      {
        if (Touch_I2C_Reserve(20U) != 0U)
        {
          if (BSP_AUDIO_OUT_SetMute(target_mute) == AUDIO_OK)
            usb_audio_applied_mute = target_mute;
          Touch_I2C_Release();
        }
      }
      if ((notify_bits & USB_AUDIO_NOTIFY_ERROR) != 0U)
      {
        if (usb_audio_prepared_output == USB_AUDIO_OUTPUT_SPDIF)
          SPDIF_TX_Stop();
        else if (Touch_I2C_Reserve(20U) != 0U)
        {
          (void)BSP_AUDIO_OUT_SetMute(AUDIO_MUTE_ON);
          Touch_I2C_Release();
        }
        usb_audio_dma_running = 0U;
        usb_audio_rebuffer_requested = 0U;
        ++usb_audio_underruns;
      }
      if ((usb_audio_rebuffer_requested != 0U) &&
          (usb_audio_dma_running != 0U))
      {
        (void)USB_Audio_StopForRebuffer();
      }
      if ((usb_audio_dma_running == 0U) &&
          ((usb_audio_write_frame - usb_audio_read_frame) >=
           usb_audio_active_start_frames))
      {
        (void)USB_Audio_FillDmaHalf(0U);
        (void)USB_Audio_FillDmaHalf(1U);
        uint8_t play_result = AUDIO_ERROR;
        uint32_t play_bytes;
        if (usb_audio_prepared_output == USB_AUDIO_OUTPUT_SPDIF)
        {
          play_bytes = sizeof(usb_audio_dma.spdif);
          play_result = (SPDIF_TX_Start(usb_audio_dma.spdif,
                                        play_bytes) != 0U) ?
                        AUDIO_OK : AUDIO_ERROR;
        }
        else if (Touch_I2C_Reserve(500U) != 0U)
        {
          play_bytes = sizeof(usb_audio_dma.pcm16);
          play_result = BSP_AUDIO_OUT_Play((uint16_t *)usb_audio_dma.pcm16,
                                            play_bytes);
          if (play_result == AUDIO_OK)
          {
            /* The WM8994 BSP Play hook always unmutes. Restore a host mute or
               a zero-gain hardware mute before releasing the codec bus. */
            usb_audio_applied_mute = 0U;
            if ((target_mute != 0U) &&
                (BSP_AUDIO_OUT_SetMute(target_mute) == AUDIO_OK))
            {
              usb_audio_applied_mute = target_mute;
            }
          }
          Touch_I2C_Release();
        }
        if (play_result == AUDIO_OK)
        {
          usb_audio_dma_running = 1U;
        }
        else
        {
          if (usb_audio_prepared_output == USB_AUDIO_OUTPUT_SPDIF)
            SPDIF_TX_Stop();
          ++usb_audio_underruns;
        }
      }
      else if (usb_audio_dma_running != 0U)
      {
        uint32_t missing = 0U;
        if ((notify_bits & USB_AUDIO_NOTIFY_DMA_HALF) != 0U)
          missing = USB_Audio_FillDmaHalf(0U);
        if ((missing == 0U) &&
            ((notify_bits & USB_AUDIO_NOTIFY_DMA_FULL) != 0U))
          missing = USB_Audio_FillDmaHalf(1U);
        if (missing != 0U)
        {
          /* Do not keep consuming one USB packet ahead forever after a track
             gap. Stop at this DMA boundary and restore the selected start
             waterline before playing again. */
          usb_audio_rebuffer_requested = 1U;
          (void)USB_Audio_StopForRebuffer();
        }
      }
    }

    USB_Audio_Publish();
  }
}

/* ST USB Audio Class callbacks. They run in USB interrupt context, so codec
 * I2C and SAI start/stop operations are deliberately handled by RTOS tasks. */
static int8_t USB_Audio_InterfaceInit(uint32_t frequency, uint32_t volume,
                                      uint32_t options)
{
  if ((frequency == USB_AUDIO_RATE_44K) ||
      (frequency == USB_AUDIO_RATE_48K))
  {
    usb_audio_requested_rate = frequency;
  }
  (void)volume; (void)options;
  return (usb_audio_prepared != 0U) ? 0 : -1;
}

static int8_t USB_Audio_InterfaceDeInit(uint32_t options)
{
  (void)options;
  return 0;
}

static int8_t USB_Audio_InterfaceCommand(uint8_t *buffer, uint32_t size,
                                         uint8_t command)
{
  (void)buffer; (void)size; (void)command;
  return 0;
}

static int8_t USB_Audio_InterfaceVolume(uint8_t volume)
{
  (void)volume;
  return 0;
}

static int8_t USB_Audio_InterfaceMute(uint8_t command)
{
  usb_audio_muted = (command != 0U) ? 1U : 0U;
  if (usb_audio_task_handle != NULL)
  {
    BaseType_t wake = pdFALSE;
    (void)xTaskNotifyFromISR(usb_audio_task_handle, USB_AUDIO_NOTIFY_DATA,
                             eSetBits, &wake);
    portYIELD_FROM_ISR(wake);
  }
  return 0;
}

