136185925/STM32F769I-DISCO-USB-Audio-Upsampler/Core/Src/usb_audio.c
static int8_t USB_Audio_InterfaceFrequency(uint32_t frequency)
{
  uint32_t previous;

  if ((frequency != USB_AUDIO_RATE_44K) &&
      (frequency != USB_AUDIO_RATE_48K))
  {
    return -1;
  }

  previous = usb_audio_requested_rate;
  if (frequency == previous)
  {
    /* Hosts may repeat SET_CUR while the stream is active. Waking the audio
       task cannot change the hardware and adds
       avoidable scheduling work during the accompanying isochronous gap. */
    return 0;
  }

  usb_audio_requested_rate = frequency;
  USB_Audio_NotifyDma(USB_AUDIO_NOTIFY_RATE);
  return 0;
}

static int8_t USB_Audio_InterfacePeriodic(uint8_t *buffer, uint32_t size,
                                          uint8_t command)
{
  if (command == AUDIO_OUT_TC) USB_Audio_ReceivePacket(buffer, size);
  return 0;
}

static int8_t USB_Audio_InterfaceGetState(void)
{
  return 0;
}

static uint32_t USB_Audio_InterfaceGetFeedback(void)
{
  const uint32_t sample_rate = usb_audio_current_rate;
  const uint32_t nominal_q16 = sample_rate << 16U;
  int32_t filtered_q8;
  int32_t queue_q8;
  int32_t error_frames;
  int32_t integral_q16;
  int64_t correction_q16;
  int64_t correction_limit_q16;
  int64_t integral_limit_q16;
  uint32_t queued;

  /* Until SAI DMA is consuming real samples there is no meaningful waterline
     error. Advertise the nominal rate and start the controller from center. */
  if ((usb_audio_prepared == 0U) || (usb_audio_dma_running == 0U))
  {
    usb_audio_feedback_integral_q16 = 0;
    usb_audio_feedback_filtered_queue_q8 =
        (int32_t)(USB_Audio_FeedbackTargetFrames() << 8U);
    return nominal_q16;
  }

  queued = usb_audio_write_frame - usb_audio_read_frame;
  if (queued >= USB_AUDIO_INPUT_RING_FRAMES)
  {
    queued = USB_AUDIO_INPUT_RING_FRAMES - 1U;
  }

  /* Smooth the native 2048-frame or 4x-mode 512-frame DMA refill steps before
     applying the PI loop. This loop changes only the host packet cadence;
     PLLI2S/SAI remains untouched. */
  queue_q8 = (int32_t)(queued << 8U);
  filtered_q8 = usb_audio_feedback_filtered_queue_q8;
  filtered_q8 += (queue_q8 - filtered_q8) >>
                 USB_AUDIO_FEEDBACK_FILTER_SHIFT;
  usb_audio_feedback_filtered_queue_q8 = filtered_q8;
  error_frames = (int32_t)USB_Audio_FeedbackTargetFrames() -
                 (filtered_q8 >> 8U);

  integral_limit_q16 =
      ((int64_t)sample_rate * USB_AUDIO_FEEDBACK_I_MAX_PPM * 65536LL) /
      1000000LL;
  integral_q16 = usb_audio_feedback_integral_q16;
  integral_q16 += error_frames;
  if ((int64_t)integral_q16 > integral_limit_q16)
    integral_q16 = (int32_t)integral_limit_q16;
  else if ((int64_t)integral_q16 < -integral_limit_q16)
    integral_q16 = (int32_t)-integral_limit_q16;
  usb_audio_feedback_integral_q16 = integral_q16;

  correction_q16 = ((int64_t)error_frames * USB_AUDIO_FEEDBACK_P_Q16) +
                   integral_q16;
  correction_limit_q16 =
      ((int64_t)sample_rate * USB_AUDIO_FEEDBACK_MAX_PPM * 65536LL) /
      1000000LL;
  if (correction_q16 > correction_limit_q16)
    correction_q16 = correction_limit_q16;
  else if (correction_q16 < -correction_limit_q16)
    correction_q16 = -correction_limit_q16;

  return (uint32_t)((int64_t)nominal_q16 + correction_q16);
}

USBD_AUDIO_ItfTypeDef USBD_AUDIO_fops =
{
  USB_Audio_InterfaceInit,
  USB_Audio_InterfaceDeInit,
  USB_Audio_InterfaceCommand,
  USB_Audio_InterfaceVolume,
  USB_Audio_InterfaceMute,
  USB_Audio_InterfaceFrequency,
  USB_Audio_InterfacePeriodic,
  USB_Audio_InterfaceGetState,
  USB_Audio_InterfaceGetFeedback
};
